[
    {
      "image": "https://i.ibb.co/Y8MNQG2/bmw-1.jpg",
      "name": "BMW 3 Series",
      "brand": "BMW",
      "type": "Sedan",
      "price": "$40,000",
      "short_description": "A luxury sedan with a perfect balance of performance and elegance.",
      "detail description": "BMW, Bayerische Motoren Werke AG, is a prestigious German automotive manufacturer renowned for its luxurious and high-performance vehicles. Founded in 1916, BMW has a storied history of engineering excellence and a global reputation for crafting elegant, dynamic automobiles. The brand's iconic "Ultimate Driving Machine" slogan reflects its commitment to delivering a thrilling driving experience. BMW's diverse portfolio includes a range of sedans, SUVs, and sports cars, with models like the 3 Series, 5 Series, and the sporty M Series enjoying widespread acclaim. BMW's dedication to innovation is evident through cutting-edge technology, precision engineering, and an embrace of electric and hybrid vehicles, including the BMW i3 and the electric iX3. The brand's motorsport legacy is reflected in its motorsport division, responsible for crafting high-performance M models and competing in various racing series. BMW's strong brand identity, synonymous with luxury and performance, continues to captivate automotive enthusiasts worldwide."
    },
    {
      "image": "https://i.ibb.co/Kx9DjvG/bmw-2.jpg",
      "name": "BMW 5 Series",
      "brand": "BMW",
      "type": "Sedan",
      "price": "$55,000",
      "short_description": "An executive sedan known for its advanced technology and comfort."
    },
    {
      "image": "https://i.ibb.co/h71hBJz/bmw-3.jpg",
      "name": "BMW X3",
      "brand": "BMW",
      "type": "SUV",
      "price": "$45,000",
      "short_description": "A compact luxury SUV with a sporty character."
    },
    {
      "image": "https://i.ibb.co/0X3bwTZ/bmw-4.jpg",
      "name": "BMW Z4",
      "brand": "BMW",
      "type": "Convertible",
      "price": "$60,000",
      "short_description": "A stylish and powerful convertible sports car."
    }
  ]