[
    {
      "image": "https://i.ibb.co/C5tQM9D/honda-1.jpg",
      "name": "Honda Civic",
      "brand": "Honda",
      "type": "Sedan",
      "price": "$25,000",
      "short_description": "A popular compact sedan known for its reliability and fuel efficiency.",
      "detail_description": "Honda, established in 1948 by Soichiro Honda, is a renowned Japanese automotive and motorcycle manufacturer recognized for its commitment to engineering excellence, innovation, and reliability. Honda's legacy includes the production of some of the world's most iconic motorcycles, such as the Honda Super Cub and the legendary Honda Civic. The brand's diverse lineup encompasses everything from compact cars like the Honda Fit to popular sedans like the Honda Accord, and SUVs such as the Honda CR-V. Honda is also celebrated for its pioneering efforts in fuel-efficient and eco-friendly vehicles, with the introduction of the Honda Insight, one of the earliest hybrid cars, and the development of the hydrogen-powered Honda Clarity. Safety and advanced technology are paramount for Honda, showcased through features like Honda Sensing, an advanced driver assistance system. Honda has established a global presence, earning a reputation for quality, practicality, and a strong focus on customer satisfaction. With a dedication to innovation and sustainability, Honda continues to be a prominent force in the automotive industry."
    },
    {
      "image": "https://i.ibb.co/DCMgcyc/honda-2.jpg",
      "name": "Honda CR-V",
      "brand": "Honda",
      "type": "SUV",
      "price": "$30,000",
      "short_description": "A versatile and comfortable SUV for family adventures."
    },
    {
      "image": "https://i.ibb.co/Kzz9ZMM/honda-3.jpg",
      "name": "Honda Accord",
      "brand": "Honda",
      "type": "Sedan",
      "price": "$28,000",
      "short_description": "A midsize sedan with a well-balanced mix of style and performance."
    },
    {
      "image": "https://i.ibb.co/MfMKgNc/honda-4.jpg",
      "name": "Honda Fit",
      "brand": "Honda",
      "type": "Hatchback",
      "price": "$20,000",
      "short_description": "A versatile and compact hatchback designed for urban life."
    }
  ]