[
    {
      "image": "https://i.ibb.co/RpjFMLC/mb-1.jpg",
      "name": "Mercedes-Benz A-Class",
      "brand": "Mercedes-Benz",
      "type": "Hatchback",
      "price": "$35,000",
      "short_description": "A compact luxury hatchback with advanced technology and style.",
      "detail_description": "Mercedes-Benz, a prestigious German luxury automobile manufacturer, is synonymous with elegance, innovation, and engineering excellence. Founded in 1926, the brand's three-pointed star emblem represents its dominance on land, sea, and air. Mercedes-Benz has a storied history of pioneering advancements in automotive technology and safety. It has consistently produced a lineup of opulent vehicles, from the iconic Mercedes-Benz S-Class, known for its cutting-edge technology and unparalleled comfort, to the sporty and performance-oriented Mercedes-AMG models. Mercedes-Benz's commitment to innovation is evident in its development of autonomous driving systems, electric vehicles like the EQC, and a dedication to sustainable mobility. The brand's reputation for safety and advanced driver assistance features, exemplified through the Mercedes-Benz Intelligent Drive, makes it a benchmark for automotive safety. With a global presence and a dedication to delivering an unmatched luxury experience, Mercedes-Benz continues to set the standard for high-end automobiles and stands as a symbol of German engineering excellence and luxury."
    },
    {
      "image": "https://i.ibb.co/RPBCw6y/mb-2.jpg",
      "name": "Mercedes-Benz C-Class",
      "brand": "Mercedes-Benz",
      "type": "Sedan",
      "price": "$45,000",
      "short_description": "A sophisticated and elegant luxury sedan with performance."
    },
    {
      "image": "https://i.ibb.co/vwRq23p/mb-3.jpg",
      "name": "Mercedes-Benz GLC",
      "brand": "Mercedes-Benz",
      "type": "SUV",
      "price": "$50,000",
      "short_description": "A midsize luxury SUV offering a blend of comfort and versatility."
    },
    {
      "image": "https://i.ibb.co/NNMHngV/mb-4.jpg",
      "name": "Mercedes-Benz SLS AMG",
      "brand": "Mercedes-Benz",
      "type": "Sports Car",
      "price": "$150,000",
      "short_description": "An iconic and powerful sports car with gullwing doors."
    }
  ]